## 文件操作

### 读取文件内容：pd.read_csv()/pd.read_table()

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('examples/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

指定分隔符

In [7]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

读取没有标题的文件

In [8]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

### 设置默认列名：pd.read_csv('', header=)

In [9]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

### 自定义列名：pd.read_csv('', names=[])

In [10]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 设置表格的列数据变为行索引：pd.read_csv('', index_col=)

设置一列数据作为一行索引

In [24]:
names = ['a', 'b', 'c', 'd', 'message']

In [25]:
df = pd.read_csv('examples/ex2.csv', names=names, index_col='message')

In [26]:
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [27]:
df.index

Index(['hello', 'world', 'foo'], dtype='object', name='message')

In [28]:
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]], dtype=int64)

In [30]:
df.index.name

'message'

设置多列数据作为多行索引

In [4]:
df = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [5]:
df

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

### 以列表形式读取txt文件内容：list(open('txt文件'))

In [1]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

### pd读取txt文件内容：pd.read_table('txt文件', sep='\s+')

In [4]:
df = pd.read_table('examples/ex3.txt', sep='\s+')

In [5]:
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [7]:
df.loc['aaa']

A   -0.264438
B   -1.026059
C   -0.619500
Name: aaa, dtype: float64

In [8]:
df['A']

aaa   -0.264438
bbb    0.927272
ccc   -0.264273
ddd   -0.871858
Name: A, dtype: float64

### 读取csv文件时跳过某些行：skiprows=[]

In [9]:
pd.read_csv('examples/ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [10]:
df = pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

In [11]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 指定表格中某些文本为 NaN：na_values()

直接指定某些内容转换成空值

In [33]:
df = pd.read_csv('examples/ex5.csv')

In [34]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [35]:
pd.isnull(df)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [36]:
# 将表格中的 foo 和 world 字符串都设置成空值
df = pd.read_csv('examples/ex5.csv', na_values=['foo', 'world'])

In [37]:
df

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8      NaN
2     three  9  10  11.0  12      NaN

指定某些列的某些字符串转换成空值

In [41]:
# 指定 something 这一列的 one、three 转换成空值；
# d 这一列的 4、12 转换成空值
na_values = {'something': ['one', 'three'], 'd': [4, 12]}

In [42]:
df = pd.read_csv('examples/ex5.csv', na_values=na_values)

In [43]:
df

  something  a   b     c    d message
0       NaN  1   2   3.0  NaN     NaN
1       two  5   6   NaN  8.0   world
2       NaN  9  10  11.0  NaN     foo

### 指定读取文件的前n行：nrows=n

In [45]:
df = pd.read_csv('examples/ex6.csv')

In [46]:
df

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [48]:
df = pd.read_csv('examples/ex6.csv', nrows=8)

In [49]:
df

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K

### 逐块读取大文件n行内容：chunksize=n

In [86]:
df = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [83]:
df

In [85]:
for chunk in df:
    print(chunk.shape)

(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)
(1000, 5)

### 逐块读取大文件内容：iterator=True

In [89]:
df = pd.read_csv('examples/ex6.csv', iterator=True)

In [80]:
df

In [81]:
for iter_obj in df:
    print(iter_obj.shape)

(10000, 5)

### 指定每次读取n行分块取得的文件内容：df.get_chunk(n)

In [92]:
df1 = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [93]:
df1.get_chunk(10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [95]:
df1.get_chunk(5)

         one       two     three      four key
10  0.240564 -0.328249  1.252155  1.072796   8
11  0.764018  1.165476 -0.639544  1.495258   R
12  0.571035 -0.310537  0.582437 -0.298765   1
13  2.317658  0.430710 -1.334216  0.199679   P
14  1.547771 -1.119753 -2.277634  0.329586   J

In [90]:
df2 = pd.read_csv('examples/ex6.csv', iterator=True)

In [91]:
df2.get_chunk(10)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [96]:
df2.get_chunk(5)

         one       two     three      four key
10  0.240564 -0.328249  1.252155  1.072796   8
11  0.764018  1.165476 -0.639544  1.495258   R
12  0.571035 -0.310537  0.582437 -0.298765   1
13  2.317658  0.430710 -1.334216  0.199679   P
14  1.547771 -1.119753 -2.277634  0.329586   J

### 保存数据到csv文件：to_csv()

In [97]:
df = pd.read_csv('examples/ex5.csv')

In [98]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [100]:
df.to_csv('examples/out.csv')

### 保存时使用指定分隔符

In [101]:
df = pd.read_csv('examples/ex5.csv')

In [102]:
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [103]:
df.to_csv('examples/out1.csv', sep='|')

**使用分隔符后，每行的内容都放在第一列中**

In [104]:
df = pd.read_csv('examples/out1.csv')

In [105]:
df

  |something|a|b|c|d|message
0           0|one|1|2|3.0|4|
1         1|two|5|6||8|world
2   2|three|9|10|11.0|12|foo

In [106]:
df.shape

(3, 1)